tap "homebrew/bundle"
brew "python@3.11"
brew "awscli"
brew "awslogs"
brew "bat"
brew "ffmpeg"
brew "gcc"
brew "gnupg"
brew "go"
brew "kafka"
brew "jq"
brew "mas"
brew "node"
brew "openjdk"
brew "pre-commit"
brew "python@3.9"
brew "rclone"
brew "qsv"
brew "terraform"
brew "terraform-docs"
brew "tree"
brew "youtube-dl"
brew "hashicorp/tap/vault"
cask "coconutbattery"
cask "drawio"
cask "grandperspective"
cask "iina"
cask "monitorcontrol"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "postman"
mas "Acorn", id: 1547371478
mas "AdGuard for Safari", id: 1440147259
mas "AmorphousDiskMark", id: 1168254295
mas "Amphetamine", id: 937984704
mas "Boop", id: 1518425043
mas "Downlink", id: 1454269192
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Hand Mirror", id: 1502839586
mas "Hidden Bar", id: 1452453066
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "Pixelmator Pro", id: 1289583905
mas "Redacted", id: 984968384
mas "Reeder", id: 1529448980
mas "Soulver 3", id: 1508732804
mas "TextSniper", id: 1528890965
mas "The Magic Highlighter", id: 1663033087
mas "Xcode", id: 497799835
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "atlassian.atlascode"
vscode "AykutSarac.jsoncrack-vscode"
vscode "databricks.databricks"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "SonarSource.sonarlint-vscode"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
